{"context": "User: I need to know how to pay the dial-in search account fees.\nAgent: The custoers must pay a deposit with the application, and it should be enough to pay for two months of searches. Was your application accepted?\nUser: Yes, it was.\nAgent: then, your deposit will be added to your new account balance.\nUser: Can you tell me some of the organizations that are exempt from the search fees?\nAgent: Some of the exempted organizations are any public organization, its officers, a volunteer fire company, volunteer ambulance service, etc. These organizations are exempt from the search fee.\nUser: What to do in case none of the users performed a search that the DMV contacted me for?\nAgent: You should contact the DMV immediately.\nUser: Why would the DMV contact me about a search?", "document": "DIAL-IN search accounts#3_0Log On to DIAL - IN [1 ] \n\nWhat business records must I keep to document the searches I perform? \nThe business records you keep must exist prior to the search you perform and must establish the business purpose of the search. Common examples of business records include invoices, retainer agreements, employment applications, consent forms, accident reports, and surveillance reports and numerous other types of records. The Terms of Service of your Search Account require you to maintain these records and to provide them to DMV when requested. \n\nWill DMV contact me about the searches I perform using my DIAL-IN Search Account? \nYes , DMV may ask you about a DIAL - IN search you performed. We inquire about searches to monitor compliance with the DIAL - IN Terms of Service . You must respond to the inquiry whether or not you have business records that support your search. Your response will be considered an incomplete reply if you do not give us the business records. You can complete an inquiry at any time if you send us the requested acceptable business records. If you performed the search on behalf of a client , you will need to show permissible use of your client, and your client agent relationship. If you personally did not perform the search we have inquired about , please check with the other users of your DIAL - IN account to see if one of them performed the search. If none of the known users performed the search , contact us immediately. If you do not respond to our inquiry about a DIAL - IN search, your search privileges will be suspended until you respond. \n\nWill you tell a motorist if I searched his records? \nYes. Records of searches are public records. If a motorist asks the DMV if his records were searched , the DMV supplies him with the name and business address of the DIAL - IN account holder , and the time, date and search criteria used to search for the records. We do not disclose the DIAL - IN account numbers of the account holder that performed the search. \n\nHow do I contact DMV about my Dial-in Search Account? \nYou can contact us at: NYSDMV DIAL - IN AccountsRoom 2316 Empire State PlazaAlbany, NY 12228 473 - 2137e - mail: [email protected] [5 ] \n\nNote on browser compatibility \nWe are upgrading our security protocols to better protect your data. To verify your browser is compatible to continue using any of the state's government websites , please visit https://encryption.ny.gov/ [6]. If your browser is not currently compatible , please update it to the newest version. ", "response": "The DMV may contact you to ask you about a search to make sure you comply with the Dial-In Terms of Service."}
{"context": "User: Oh, hi. Please, i'm looking for some info about family benefits. could you help me out?\nAgent: Are you currently receiving any disability benefits?\nUser: Yeah, i started to receive it recently.", "document": "\n\nBenefits Planner: Family Benefits \nWhen you start receiving disability benefits , certain members of your family may also qualify for benefits on your record. Benefits may be paid to your : spouse; divorced spouse ; children; disabled child ; and adult child disabled before age 22. If any of your qualified family members apply for benefits , we will ask for their Social Security numbers and their birth certificates. If your spouse is applying for benefits , we may also ask for proof of marriage and dates of prior marriages, if applicable. \n\nBenefits For Your Divorced Spouse \nIf you are divorced, even if you have remarried , your ex - spouse may qualify for benefits on your record. If your ex - spouse will also receive a pension based on work not covered by Social Security, such as government or foreign work, his or her Social Security benefit on your record may be affected. To qualify on your record , your ex - spouse must : have been married to you for at least 10 years ; be at least 62 years old ; be unmarried ; and not be eligible for an equal or higher benefit on his or her own Social Security record, or on someone else's Social Security record. \n\nBenefits For Your Children \nWhen you qualify for Social Security disability benefits , your children may also qualify to receive benefits on your record. Your eligible child can be your biological child, adopted child, or stepchild. A dependent grandchild may also qualify. To receive benefits , the child must be unmarried and be : under age 18 ; or 18 - 19 years old and a full - time student no higher than grade 12 ; or 18 or older and have a disability that started before age 22. Normally , benefits stop when children reach age 18 unless they are disabled. However , if the child is still a full - time student at a secondary or elementary school at age 18 , benefits will continue until the child graduates or until two months after the child becomes age 19, whichever is first. Find out more about Benefits For A Disabled Child. \n\nPublications \nDisability Benefits Benefits For Children What You Need To Know When You Get Social Security Disability Benefits Information for Government Employees Benefits For Children With Disabilities ", "response": "Well, in that case, i can tell you that some members of your family may also qualify to get benefits on your record."}
{"context": "User: I wanted more information on VA benefits and project 112", "document": "\n\nExposure through Project 112 or Project SHAD \nIf you were a part of chemical and biological warfare testing through Project 112 or Project Shipboard Hazard and Defense SHAD , you may be at risk for certain illnesses. The Department of Defense s Deseret Test Center in Fort Douglas, Utah, conducted this testing, which took place aboard ships and on land in various locations from 1962 to 1974. Find out if you can get disability compensation or benefits. \n\nCan I get disability benefits from VA? \nYou may be able to get disability benefits if you meet both of the requirements listed below. Both of these must be true : You were part of Projects 112 or SHAD testing from 1962 to 1974 , and You have an illness believed to be caused by the testing \n\nWho s covered? \nVeterans Qualified survivors \n\nWhat kind of disability benefits can I get? \nHealth care Compensation payments \n\nHow do I get these benefits? \nYou ll need to file a claim for disability compensation. You can call the VA Special Issues Helpline at 800 - 749 - 8387. Or you can file a claim online. Find out how to file a claim for disability compensation If you were part of Projects 112 or SHAD from 1962 to 1974 and want to know more about a certain test site, ship, or unit , see the declassified Department of Defense fact sheets. Get declassified Department of Defense fact sheets If you have a question about the tests , if you have any information that can help show you were part of them including whether you may have been part of them or contact the Department of Defense at 800 - 497 - 6261. ", "response": "Were you part of chemical and biological warfare testing through Project 112 or Project Shipboard Hazard and Defense SHAD?"}

