{"context": "User: Oh, hi. Please, i'm looking for some info about family benefits. could you help me out?\nAgent: Are you currently receiving any disability benefits?\nUser: Yeah, i started to receive it recently.","document": "\n\nBenefits Planner: Family Benefits \nWhen you start receiving disability benefits , certain members of your family may also qualify for benefits on your record. Benefits may be paid to your : spouse; divorced spouse ; children; disabled child ; and adult child disabled before age 22. If any of your qualified family members apply for benefits , we will ask for their Social Security numbers and their birth certificates. If your spouse is applying for benefits , we may also ask for proof of marriage and dates of prior marriages, if applicable. \n\nBenefits For Your Divorced Spouse \nIf you are divorced, even if you have remarried , your ex - spouse may qualify for benefits on your record. If your ex - spouse will also receive a pension based on work not covered by Social Security, such as government or foreign work, his or her Social Security benefit on your record may be affected. To qualify on your record , your ex - spouse must : have been married to you for at least 10 years ; be at least 62 years old ; be unmarried ; and not be eligible for an equal or higher benefit on his or her own Social Security record, or on someone else's Social Security record. \n\nBenefits For Your Children \nWhen you qualify for Social Security disability benefits , your children may also qualify to receive benefits on your record. Your eligible child can be your biological child, adopted child, or stepchild. A dependent grandchild may also qualify. To receive benefits , the child must be unmarried and be : under age 18 ; or 18 - 19 years old and a full - time student no higher than grade 12 ; or 18 or older and have a disability that started before age 22. Normally , benefits stop when children reach age 18 unless they are disabled. However , if the child is still a full - time student at a secondary or elementary school at age 18 , benefits will continue until the child graduates or until two months after the child becomes age 19, whichever is first. Find out more about Benefits For A Disabled Child. \n\nPublications \nDisability Benefits Benefits For Children What You Need To Know When You Get Social Security Disability Benefits Information for Government Employees Benefits For Children With Disabilities "}
{"context": "User: I have a restricted use license issued in NJ and need information about driving in NY.\nAgent: Do you meet NY requirements for obtaining a restricted license?\nUser: Yes, I do.\nAgent: Great. You can receive a restricted license to drive in NY. The restrictions will be the same as the same as the restrictions for a driver with a NY driver license.\nUser: Where can I apply for the restricted driver license?", "document": "NY State Adventure License FAQs#3_0\n\n7. Is there an additional fee to have icons added to my DMV photo document? \nThere are no additional fees if you request the icons be added at the time of your photo document renewal. If you wish to have the icons added prior to renewal , you will be required to pay the amendment fee as required by the Vehicle and Traffic Law $12.50 for driver licenses / permits and $5.00 for non - driver identification cards. \n\n8. Can I have these icons removed from my DMV photo document? \nYes. You may contact the agency Parks or DEC that issued the lifetime license, privilege or credential to request they notify DMV to remove the icons. There is no fees associated with these requests. Any icon, except the Empire Passport icon, may also be removed by visiting a NY State DMV office. When removing icons through a visit to a DMV office , you will be required to pay the amendment fee as required by the Vehicle and Traffic Law $12.50 for driver licenses / permits and $5.00 for non - driver identification cards. \n\n9. Where is my document number located for my DMV issued photo document? \nIt is now located on the back of the photo document. If you have an enhanced document , it is located in the top line of the Machine Readable Zone and is the 10 alpha - numeric digits that appear after the \" ID USA \". If you do not have an enhanced document , it is located above the box with the wording , \" I hereby make an anatomical gift \". \n\n10. How long will it take to get my new photo document with the icons? \nIf you paid the fee to request the icons be added to your photo document immediately $12.50 for driver licenses / permits and $5.00 for non - driver identification cards , it may take approximately 2 weeks for you to receive your photo document in the mail. If you opted to have the icons printed at your next document renewal , you will receive your photo document with the icons after you renew your photo document. \n\n11. What if I don t receive my new photo document with the icons? \nIf it has been more than 2 weeks since you requested your photo document with DEC or Parks , contact the agency where you placed the order. For Boating Safety Certificate and Empire Passport holders , contact Parks via their website: www.parks.ny.gov [3]. For Lifetime Sportsman, Small / Big Game, Bow Hunting, Trapping, Muzzle Loading, or Fishing, contact DEC via their website : www.dec.ny.gov [4]. "}
{"context": "User: How much will my service member pay for dependent coverage?\nAgent: Nothing.s We provide dependent coverage at no cost until the child is 18 years old , or sometimes longer if the child meets one of the requirements listed below\nUser: To continue receiving dependent coverage after age 18, what are the requirements?", "document": "\n\nFamily Servicemembers Group Life Insurance (FSGLI) \nFamily SGLI, also known as Family Servicemembers Group Life Insurance FSGLI, offers coverage for the spouse and dependent children of service members covered under full - time SGLI. Find out how much coverage you may qualify for and how to apply for and manage your benefits. \n\nAm I eligible for FSGLI? \nYou may be able to get FSGLI if you re the spouse or dependent child of a service member who meets one of the requirements listed below. One of these must be true. The service member is : On active duty and covered by full - time SGLI , or A member of the National Guard or Ready Reserve covered by full - time SGLI You may qualify to get FSGLI as the spouse of someone with SGLI coverage no matter if your own status is active duty, retired, or civilian. \n\nWho s covered? \nSpouses of service members covered under SGLI Dependent children of service members covered under SGLI \n\nHow much coverage can I get with Family Servicemembers Group Life Insurance? \nUp to a maximum of $100,000 of coverage for you as a spouse , not to exceed your service member s SGLI coverage , and $10,000 for each dependent child. Dependent children get free coverage. \n\nHow do I get these benefits? \n\n\nIf you re the civilian spouse of a service member signed up for full-time SGLI \nWe ll automatically insure you under FSGLI. In this case , we ll automatically take your premium out of your service member s pay. \n\nIf you re a military spouse and you were married on or after January 2, 2013 \nWe won t automatically cover you. You ll need to sign up through your service member. If your service member is a member of the Army, Navy, Air Force, Marines, Coast Guard, or National Oceanic and Atmospheric Administration , have them sign you up online through the SGLI Online Enrollment System SOES. To access SOES , have your service member : Go to milConnect Sign in. Go to Benefits, Life Insurance SOES- SGLI Online Enrollment System to sign up. Your service member can log in with their CAC or DS Logon using Internet Explorer as soon as they receive notice that they can start using SOES. If your service member is part of the Public Health Service , you ll need to fill out the Spouse Coverage Election and Certificate SGLV 8286A and have them turn it in to their unit s personnel officer. Download the Spouse Coverage Election and Certificate PDF "} 
