{"document": "New York State Insurance Requirements#3_0\n\nDo I need insurance? \nYes. To register a vehicle in New York State you must have New York State issued automobile liability insurance coverage. If you do not maintain the coverage , the DMV can suspend your vehicle registration and your driver license. \n\nWhat kind of insurance do I need? \nNew York law requires that you have auto liability insurance coverage. The minimum amount of liability coverage is $ 10,000 for property damage for a single accident $ 25,000 for bodily injury and $50,000 for death for a person involved in an accident $ 50,000 for bodily injury and $100,000 for death for two or more people in an accident Your liability insurance coverage must while the registration is valid, even if you don t use the vehicle there are exceptions for motorcycles 1 remain in effect be New York State insurance coverage , issued by a company licensed by the NY State Department of Financial Services and certified by NY State DMV - out - of - state insurance is never acceptable be issued in the name of the vehicle registrant, and remain in the name of the registrant at all times 2 The New York State Department of Financial Services website has more information about liability insurance and insurance companies licensed in New York: http://www.dfs.ny.gov [1]. \n\nMore than 2 names on a vehicle registration \nThere can only be 1 or 2 names on a registration registrants. Both the primary registrant first name listed on the registration and the co - registrant must sign the Vehicle Registration / Title Application PDF [2] MV-82 and provide their proofs of identity and date of birth. Both names must appear on the Insurance ID Card. \n\nDo I need insurance to register my vehicle? \nYes. The DMV requires auto liability insurance to register a vehicle in New York. When you get insurance , your insurance company will issue proof of insurance in two ways. It will give you two original NY State Insurance ID Cards see a sample [3] or provide you with access to your digital electronic NY State Insurance ID Card 3 send an electronic notice of insurance coverage to the DMV your insurance agent or broker cannot file this notice Your NY State Insurance Identification Cards and the electronic notice of insurance together verify your insurance coverage. We need both. You must register your vehicle at the DMV within 180 days of the effective date on your insurance ID card. Bring one copy or form of your Insurance Identification Cards with you. The DMV office will keep the paper card. Keep the other paper card with the vehicle as your proof of insurance. Anyone operating your vehicle must be able to provide proof of insurance while they are operating the vehicle. \n\nDoes the name on my vehicle registration application and Insurance Identification Card need to be the same? \nYes. Your insurance cards must have the same name as the name on your vehicle registration application. ", "context": "User: I'm enquiring about out of state insurance docs\nAgent: We will never accept out - of - state vehicle insurance coverage of any type\nAgent: Is your vehicle registered in New York?\nUser: Yes\nAgent: it must have New York State auto liability insurance coverage.\nYour motorcycle must have insurance coverage any time it is operated on a public road or highway. Unlike most other motor vehicles , motorcycles are registered for one year rather than two\nUser: Do I need insurance to register my vehicle?\nAgent: Yes the DMV requires auto liability insurance to register a vehicle in New York\nUser: How long do I have to register?\nAgent: You must register your vehicle at the DMV within 180 days of the effective date on your insurance ID card\nUser: Where can I find more information?", "label": "positive", "response": "The New York State Department of Financial Services website has more information about liability insurance and insurance companies licensed in New York : http://www.dfs.ny.gov"}
{"document": "Amend or replace a business license for a repair or body shop#3_0\n\nAmend or replace \nTo amend the registration or get a replacement duplicate document for your current Repair & Body Shop , you must submit the Request for Business Amendment / Duplicate Certificate pdf [1] MV-253 G. Mail it to NYS DMV Bureau of Consumer & Facility Services Application Unit P.O. Box 2700 Albany , NY 12220 - 0700 You will receive a replacement document in the mail in approximately 5 to 7 business days. We cannot fax a copy to you. \n\nChange of address \nTo report a change of address for your business , you must complete a Statement of Ownership and/or Permission to Use Place of Business pdf [2] VS-19. You can also call the DMV Office of Vehicle Safety and Clean Air at 1 - 518 - 474 - 4653 to get the form, or call 1 - 518 - 474 - 0919 to get more information. It will take 6 to 8 weeks for us to process your application. \n\nCertificate of Occupancy \nRepair shops must also provide a Certificate of Occupancy, local license or town letter as proof of zoning approval. If the new location was previously registered as a repair shop , please provide the Facility number or name of that shop. This may be accepted as proof of zoning. If you also have an Inspection Station License , please see Inspection Station Cap Information [3]. ", "context": "User: I'm enquiring about out of state insurance docs", "label": "negative", "response": "I do not have information about out of state insurance docs."}
{"document": "Conditional and restricted use licenses#3_0You must apply for a conditional or restricted use license in person at a DMV office. You can do this at most, but not all, Motor Vehicles offices. Contact your nearest office [1] to find out where you can apply. \n\nConditional \nThe DMV can issue a conditional license to a qualified driver whose NY State license has been suspended or revoked because of an alcohol or drug - related violation. The driver must attend a Impaired Driver Program IDP [2] previously known as Drinking Driving Program DDP approved by the DMV. \n\nRestricted use \nThe DMV can issue a restricted use license to a driver who qualifies and whose license is suspended or revoked because of violations or incidents that are not alcohol or drug - related, or because of some drug - related violations. \n\nDrivers from other states \nIf you have a driver license issued in another state, and you meet the other requirements , you can receive a conditional driving privilege or a restricted driving privilege to drive in NY State. The conditions or the restrictions are the same as the conditions or restrictions for a driver with a NY State driver license. ", "context": "User: What do I need to do before my road test\nAgent: Read the manual given to you when you got your permit.\nUser: Is there anything I should practice?\nAgent: I would recommend practicing and studying it all.\nUser: I'd also want to find out on what are the basis for conditional license to be given to drivers?", "label": "positive", "response": "The DMV can issue a conditional license to a qualified driver whose NY State license has been suspended or revoked because of an alcohol or drug - related violation"}
{"document": "Get a license to drive a taxi or livery vehicle#3_0To drive taxis and other livery vehicles in New York State , you must be 18 years of age or older and you must have a driver license that is one of these classes Class A commercial driver license CDL Class B CDL Class C CDL Class E driver license \n\nIf you plan on traveling \nWe recommend you come to the DMV now to get an Enhanced or REAL ID, and avoid a second office visit later. 1 Learn about Enhanced, REAL ID and Standard documents [1]. \n\nChange from a Class D to a Class E license \n\n\nStep 1: Complete the \nApplication for Standard Permit, Driver License for Non - Driver ID Card PDF [2] MV-44 \n\nStep 2: Determine what identification you need to bring to the DMV \nif you want a REAL ID or Enhanced, complete this document guide to know what proofs of identity to bring to an office Find your proofs [3 ] On the first page , select : Change my existing NY State license / ID to a REAL ID or Enhanced if you want a Standard that will display \" NOT FOR FEDERAL PURPOSES \" , bring your current NY State license as proof of identity \n\nStep 3: Go to the DMV \nsurrender your Class D license. apply and pay for your Class E license the fee depends on the expiration date of your current driver license - we cannot calculate your fee until you apply take the vision test or prove that you meet our vision requirements [4 ] \n\nStep 4: Get your Class E license in the mail \nAllow 2 weeks for your new license to arrive. \n\nIf you do not have New York State driver license \nIf you do not have a driver license , learn how to apply for your first driver license [5]. Apply for a Class E driver license instead of a Class D driver license. The Class D license and the Class E license both require the same vision, written and road tests. The New York City Taxi and Limousine Commission T&LC regulates taxi drivers and livery drivers in New York City. If you plan to drive a taxi or livery vehicle in New York City , contact the Taxi and Limousine Commission [6]. Starting in October 2020 , you will need an Enhanced or REAL ID to board a domestic flight unless you have a passport. If your license or permit was issued before October 30 , 2017 and is not Enhanced , you have a Standard document. Newly issued Standard license and permits state : ' NOT FOR FEDERAL PURPOSES ' ", "context": "User: I need help getting a N.Y. License\nAgent: Do you have a license in another state?\nUser: No, I don't have a license.", "label": "negative", "response": "Unfortunately, no relevant information is found."}
